tap "homebrew/bundle"

# https://aquaproj.github.io/docs/install/#homebrew
tap "aquaproj/aqua"

# GNU toolchain for macOS
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "diffutils"
brew "grep"
brew "less"
brew "tree"
brew "make"
brew "curl"
brew "wget"

# Shell
brew "starship"
brew "bash"
brew "bash-completion"
brew "mosh"

# VCS
brew "git"
brew "git-lfs"
brew "gh"
brew "ghq"

# Enhancements
brew "readline"
brew "rlwrap"
brew "zoxide"
brew "fzf"
brew "bat"
brew "eza"
brew "ripgrep"
brew "ripgrep-all"
brew "fd"
brew "delta"

# Editor
brew "emacs"
brew "neovim"
brew "neovim-remote"

# JSON and YAML processors
brew "jq"
brew "yq"

# Package managers
brew "aquaproj/aqua/aqua"
brew "asdf"

# Terminal Multiplexer
brew "tmux"

# Terminal
cask "alacritty"
cask "font-hack"
cask "font-hack-nerd-font"
