tap "homebrew/bundle"
tap "homebrew/core"

brew "coreutils"
brew "diffutils"
brew "findutils"
brew "moreutils"
brew "grep"
brew "tree"
brew "curl"
brew "wget"
brew "make"
brew "mosh"
brew "tmux"
brew "git"
brew "git-lfs"
brew "gh"
brew "jq"
brew "yq"
brew "fzf"
brew "ripgrep"
brew "emacs"
brew "neovim", args: ["HEAD"]
brew "neovim-remote"
brew "starship"
brew "pre-commit"
